namespace Побитови_операции
{
    using System;
    
    class Program
    {
        static void Main()
        {
            // 1 бит - място или 0 или 1
            // 1011 - 4 бит
            // 1 bute - 8 bits
            // 10B - bbute, 10b - bit
            // 1011 - тетрада 
            // 16 bits = 2B = 1 word

            /*
            int num = 20;
            Console.WriteLine(sizeof(short) * 8);
            Console.WriteLine(Convert.ToString(num, 2));
            Console.WriteLine(Convert.ToString(num, 2).PadLeft(32, '0')); // как реално е записано.
            */

            // 0000 - 0 възможни начина.
            // 1111 - 15
            // Първото число го заделяме за знаков бит.
            // 0 - положителн, 0 / 7 (+)
            // 1 - отрицателни.

            // Как се съхраняват числата?
            /*
            ПК - тетрада - знаков бит е 0 (+). Прав код.
            Числото 5 - 0101.

            ОК тетрада - знаков бит е 1 (-). Обратен код.
            Числото -5 - 1010.

            +0 / -0 = 0.
            ДК - допълнителен код.

            Процесора само събира.
            ПК (а) + ДК(б) = ПК(а--б) 

            */

            /*
                      16 8 4 2 1
             20 - 0 / 1  0 1 0 0
                  1 / 0  1 0 1 1

            int num = -20;
            Console.WriteLine(Convert.ToString(num, 2).PadLeft(32, '0'));
            */

            /*
            101    ...   00001 - ПК
            - 1  1/ .... 11110
            
            int num = -1;
            Console.WriteLine(Convert.ToString(num, 2).PadLeft(32, '0'));
            */

            /*
            250 - 58 ПК (250)
                    +
                     ДК (58)

                 1101
                +
                 1001
                10110 - 22
            */

            /*
            Буфер - каквото подадеш на входа това излиза.
            
            Нот - 0, 1 --- 1, 0
            
            AND -  "ИИ"
            
            OR - ||
            00 - 0
            0 0 0 1  -- 0, 1, 1, 1
            0 1 1 1

            a , b = c
            0 + 0 = 0
            0 + 1 = 1
            1 + 0 = 1
            1 + 1 = 10
            */

        }
    }
}